app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2021-04-22 01:15:09.767949"], ["updated_at", "2021-04-22 01:15:09.767949"]]
---
    def create
        @location = Location.create(location_params)