app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("name", "age", "username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["age", 0], ["username", "test"], ["password", "test"], ["created_at", "2021-04-21 21:08:46.709335"], ["updated_at", "2021-04-21 21:08:46.709335"]]