app/controllers/vacations_controller.rb

SELECT "vacations".* FROM "vacations"
---
    def index
        @vacations = Vacation.all

SELECT "vacations".* FROM "vacations" WHERE "vacations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @vacation = Vacation.find(params[:id])

INSERT INTO "vacations" ("title", "note", "user_id", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test Vacation"], ["note", "Test"], ["user_id", 1], ["location_id", 1], ["created_at", "2021-04-22 15:20:12.055850"], ["updated_at", "2021-04-22 15:20:12.055850"]]
---
    def create

        @vacation = Vacation.create(vacation_params)