app/models/vacation.rb

SELECT "vacations".* FROM "vacations"
---
    def self.vacation_array_to_json(vacations)
        vacations.map do |vacation|